<?php

use Illuminate\Database\Seeder;

class QuestionsSeeder extends Seeder
{

    public function run()
    {
        {
            $questions = ['ศิษย์น้อง หากหมู่บ้านนินจาต้องการนำเทคโนโลยี Cloud เข้ามาในหมู่บ้านแต่ต้องยื่นเรื่องให้นินจาผู้เฒ่า ถ้าน้องเป็นนินจานักไอที น้องจะอธิบายให้ผู้เฒ่าเข้าใจ และนำ Cloud Technology เข้ามาใช้ในหมู่บ้านได้อย่างไร ?',
                'ในยุคที่เทคโนโลยีกำลังเข้ามา Disrupt หรือสร้างความเปลี่ยนแปลงให้กับธุรกิจ ซึ่งหนึ่งในนั้นคือ  Blockchain ศิษย์พี่อยากทราบว่า ถ้าศิษย์น้องเป็นเจ้าของอสังหาริมทรัพย์ เจ้าจะนำความรู้ ความเข้าใจ และประโยชน์ของเทคโนโลยี Blockchain มาใช้กับอสังหาริมทรัพย์อย่างไร ?',
                'ศิษย์น้อง หากเจ้า ได้รับสิทธิ์ในการชี้ชะตา โดยให้เลือกระหว่างภารกิจไม่สำเร็จ แต่ศิษย์ร่วมสำนักของเจ้าทุกคนรอด กับภารกิจสำเร็จแต่ศิษย์ร่วมสำนักของเจ้าทุกคนต้องตาย ศิษย์น้องจะเลือกผลลัพธ์แบบไหน เพราะอะไร ?',
                'หากศิษย์น้องเป็นผู้สำเร็จวิชาลับระดับปรมาจารย์ และได้รับคัมภีร์ แต่ทว่าคัมภีร์เล่มนั้นกลับว่างเปล่า ศิษย์น้องคิดว่า ทำไมถึงเป็นเช่นนั้น',
                'ถ้าวิชานินจา เป็นความฝันที่ทำให้อยากเข้าร่วมสำนักนินจานี้ แต่มีกฎอยู่ว่า จะไม่สามารถออกไปได้จนกว่าจะฝึกวิชาสำเร็จ แต่หลังจากได้เข้ามาแล้ว กลับไม่ชอบวิชานินจานี้ตั้งแต่ในวันแรก ศิษย์น้องจะทำอย่างไรต่อไป ?',
            'ศิษย์น้องที่รัก เมื่อเจ้าได้รับสิทธิ์มาเข้าร่วมสำนักนี้แล้ว เจ้าได้วาดฝันถึงสำนักไว้ว่าอย่างไร สำนักนี้จะให้สิ่งใดกับเจ้าบ้าง ในขณะที่เจ้าได้รับการฝึกอยู่ในสำนักนี้ ? '];
            $intel_weight = [10, 80, 60, 10, 10];
            $communicate_weight = [20, 0, 10, 60, 50];
            $creative_weight = [70, 20, 30, 30, 40];

            for ($i = 0; $i < 6; $i++) {
                DB::table('questions')->insert([
                    'content' => ($questions[$i]),
                    'intelligent_weight' => $intel_weight[$i],
                    'communication_weight' => $communicate_weight[$i],
                    'creative_weight' => $creative_weight[$i],
                ]);
            }
        }
    }
}
