<?php

use Illuminate\Database\Seeder;

class QuestionsSeeder extends Seeder
{

    public function run()
    {
        {
            $questions = ['น้องเอ๋ย หากเจ้าเปิดกล่องดวงใจ เจ้าคาดฝันว่าเจ้าจักพบกับสิ่งใด จงอธิบายถึงสิ่งที่เจ้าคาดฝัน',
'จงอธิบายกลวิธีการทำงานของ ‘Merge Sort 3 Ways’ ด้วยรหัสจำลอง (Pseudocode) หรือภาษาคอมพิวเตอร์ (Programming)',
                'บัดนี้ได้เวลาแล้วที่กรุงลงกาจักเกิดการเปลี่ยนแปลง น้องเอ๋ย หากเจ้ามีโอกาสได้นำเสนอเทคโนโลยีใหม่ๆ เพียงหนึ่งอย่างแก่ชาวกรุงลงกา เจ้าเลือกที่จะนำเสนออะไร อย่างไร จงอธิบายถึงสิ่งนั้น',
                'เมื่อกงล้อแห่งกาลเวลาได้ไหลย้อนกลับ เจ้าได้พบกับสงครามระหว่างเหล่ายักษาและวานร หากเจ้าต้องเลือกเพียงหนึ่งฝ่าย เจ้าจะเลือกสวามิภักดิ์ต่อฝ่ายใด และเจ้าจักทำเช่นไรให้ฝ่ายนั้นยอมรับในตัวเจ้า',
                'ระหว่างการเดินทางเสาะหากล่องดวงใจ น้ำที่เคยมีมากกลับลดน้อยลงจนเหลือแค่พอประทังชีวิต เจ้าเลือกที่จะดื่มมันเสียเองเพียงผู้เดียว หรือยกมันให้กับพวกพ้วงของเจ้า เพราะเหตุใด' ];
            $intel_weight = [10, 80, 60, 10, 10];
            $communicate_weight = [20, 0, 10, 60, 50];
            $creative_weight = [70, 20, 30, 30, 40];

            for ($i = 0; $i < 5; $i++) {
                DB::table('questions')->insert([
                    'content' => ($questions[$i]),
                    'intelligent_weight' => $intel_weight[$i],
                    'communication_weight' => $communicate_weight[$i],
                    'creative_weight' => $creative_weight[$i],
                ]);
            }
        }
    }
}


