<?php

use Illuminate\Database\Seeder;

class SchoolSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $schools = [
            "โรงเรียนระยองวิทยาคม",
            "โรงเรียนชลกันยานุกูล",
            "โรงเรียนเทพศิรินทร์",
            "โรงเรียนวัดราชโอรส",
            "โรงเรียนจุฬาภรณราชวิทยาลัย ชลบุรี",
            "โรงเรียนวัดสุทธิวราราม",
            "โรงเรียนสวนกุหลาบวิทยาลัย ธนบุรี",
            "โรงเรียนบางปะกอกวิทยาคม",
            "โรงเรียนอิสลามวิทยาลัยแห่งประเทศไทย",
            "โรงเรียนสวนกุหลาบวิทยาลัย",
            "โรงเรียนศึกษานารี",
            "โรงเรียนอุตรดิตถ์ดรุณี",
            "โรงเรียนสุราษฎร์ธานี",
            "โรงเรียนรัตนโกสินทร์สมโภชบางขุนเทียน",
            "โรงเรียนยอแซฟอุปถัมภ์",
            "โรงเรียนเทพศิรินทร์ สมุทรปราการ",
            "โรงเรียนพนัสพิทยาคาร",
            "โรงเรียนอัสสัมชัญศรีราชา",
            "โรงเรียนสตรีวัดมหาพฤฒารามฯ",
            "โรงเรียนอัสสัมชัญศึกษา",
            "โรงเรียนจอมสุรางค์อุปถัมภ์",
            "โรงเรียนเตรียมอุดมศึกษาพัฒนาการ",
            "โรงเรียนเบญจมราชูทิศ ราชบุรี",
            "โรงเรียนทวีธาภิเศก",
            "โรงเรียนเซนต์คาเบรียล",
            "โรงเรียนสวนกุหลาบวิทยาลัย รังสิต",
            "โรงเรียนเบญจมราชาลัย ในพระบรมราชูปถัมภ์",
            "โรงเรียนนครสวรรค์",
            "โรงเรียนสารสาสน์วิเทศศึกษา",
            "โรงเรียนขลุงรัชดาภิเษก",
            "โรงเรียนโพธิสารพิทยากร",
            "โรงเรียนกาญจนาภิเษกวิทยาลัย นครปฐม",
            "โรงเรียนเตรียมอุดมศึกษาน้อมเกล้า สมุทรปราการ",
            "โรงเรียนอัสสัมชัญระยอง",
            "โรงเรียนอัสสัมชัญสมุทรปราการ",
            "โรงเรียนสระบุรีวิทยาคม",
            "โรงเรียนมัธยมวัดหนองแขม",
            "โรงเรียนวัดนวลนรดิศ",
            "โรงเรียนสตรีสมุทรปราการ",
            "โรงเรียนนครนายกวิทยาคม",
            "โรงเรียนดัดดรุณี",
            "โรงเรียนชลราษฎรอำรุง",
            "โรงเรียนอัสสัมชัญคอนแวนต์",
            "โรงเรียนชิโนรสวิทยาลัย",
            "โรงเรียนดรุณสิกขาลัย (โครงการวมว.)",
            "โรงเรียนเซนต์ฟรังซีสซาเวียร์คอนแวนต์",
            "โรงเรียนสมุทรสาครวิทยาลัย",
            "โรงเรียนสวนกุหลาบวิทยาลัย นนทบุรี",
            "โรงเรียนกรุงเทพคริสเตียนวิทยาลัย",
            "โรงเรียนหอวัง",
            "โรงเรียนธรรมวิทยามูลนิธิ",
            "โรงเรียนสารวิทยา",
            "โรงเรียนศึกษานารีวิทยา",
            "โรงเรียนสวรรค์อนันต์วิทยา",
            "โรงเรียนสตรีวิทยา2",
            "โรงเรียนผดุงนารี",
            "โรงเรียนนวมินทราชินูทิศ เตรียมอุดมศึกษาน้อมเกล้า",
            "โรงเรียนเตรียมอุดมศึกษาพัฒนาการ นนทบุรี",
            "โรงเรียนลาซาล",
            "โรงเรียนอัสสัมชัญธนบุรี",
            "โรงเรียนวัดราชบพิธ",
            "โรงเรียนเบญจมราชรังสฤษฎิ์",
            "โรงเรียนสภาราชินี จังหวัดตรัง",
            "โรงเรียนมัธยมวัดสิงห์",
            "โรงเรียนศรียาภัย",
            "โรงเรียนสตรีศรีสุริโยทัย",
            "โรงเรียนปรินส์รอยแยลส์วิทยาลัย",
            "โรงเรียนสามเสนวิทยาลัย",
            "โรงเรียนปราจิณราษฎรอำรุง",
            "โรงเรียนร้อยเอ็ดวิทยาลัย",
            "โรงเรียนเฉลิมขวัญสตรี",
            "โรงเรียนสุรนารีวิทยา",
            "โรงเรียนสตรีวัดมหาพฤฒาราม ในพระบรมราชินูปถัมภ์",
            "โรงเรียนจุฬาภรณราชวิทยาลัย เพชรบุรี",
            "โรงเรียนสตรีวัดมหาพฤฒาราม",
            "โรงเรียนจุฬาภรณราชวิทยาลัย เลย",
            "โรงเรียนสมุทรสาครบูรณะ",
            "โรงเรียนอมาตยกุล",
            "โรงเรียนอู่ทอง",
            "โรงเรียนธาตุโพนทองวิทยาคม"
        ];
        foreach ($schools as $school) {
            DB::table('schools')->insert([
                'school_name' => $school,
            ]);           
        }
    }
}
